contents/clojure-api.org
#+OPTIONS: html-style:nil
#+HTML_HEAD: <link rel="stylesheet" href="https://unpkg.com/sakura.css/css/sakura-dark.css">
#+title: Making an API with Clojure

* Introduction
** Why Clojure?
Clojure is a good choice for building an API if you want both a high level of flexibility and a high level of abstraction and composability, you can have concise, easy to read code without many of the limitations that come with things like Flask.

While targeting the JVM might not sound appealing, it does allow us to take advantage of the vast ecosystem of Java code to avoid reinventing the wheel.

Clojure might not be ideal for beginners who are learning Python or similar languages since it follows a very different paradigm.
** Prerequisite knowledge
Basic familiarity with Clojure and API patterns are recommended
* Setting up a basic server
** Hello World
This is a simple two-step process
1. First we must define a ring handler

   A basic ring handler takes a request and returns a response.  Both of these are simply maps with fields like body, status, headers, etc. and can be modified by middleware to accumulate data.

   In this example we will ignore the request and just return a simple response.  Specifying the status is not neccessary for 200.
#+begin_src clojure
(defn handler [req]
  {:status 200 :body "Hello World"})
#+end_src
2. Then we can attach the handler to a Jetty server

   Here we just need to specify the port, and {:join? false} means the function runs the server in another thread
#+begin_src clojure
(jetty/run-jetty handler {:port 8000 :join? false})
#+end_src
** Running in REPL
This works but when changes are made you will have to restart the JVM to stop the server and start it again with new code.  There are two things we can do to make working with a Clojure backend much easier from the REPL:
1. Save the server in an atom
#+begin_src clojure
(defonce server (atom nil))
(defn start-server []
  (reset! server (jetty/run-jetty handler {:port 8000 :join? false})))
(defn stop-server []
  (when-some [s @server]
    (.stop s)
    (reset! server nil)))
#+end_src
    This allows us to restart the server from the REPL, thus loading any new changes without having to restart the whole JVM.

    Using (defonce) also prevents the server atom being redefined when you load your buffer into the REPL.
2. Indirectly reference the handler

   We can improve on the code above so that we don't even have to restart the server to pick up changes.
#+begin_src clojure
 (defn start-server []
   (reset! server (jetty/run-jetty #'handler {:port 8000 :join? false})))
#+end_src
   Adding #' tells the interpreter to execute whatever function is bound to the symbol "handler" at runtime, so if you redefine "handler" the server will route to the new definition.

* Defining routes with Reitit
** Basic router
The reitit.ring/router function accepts a vector of routes as its argument.
#+begin_src clojure
(reitit.ring/ring-handler
 (reitit.ring/router
  [["/" {:get handler}]
   ["/crud" {:post create-handler
             :get read-handler
             :put update-handler
             :delete delete-handler}]]))
#+end_src
It is also easy to nest routes
#+begin_src clojure
(reitit.ring/ring-handler
 (reitit.ring/router
  [["/" {:get handler}]
   ["/api"
    ["/one" {:get handler-one}]
    ["/two" {:get handler-two}]]]))
#+end_src
** Using middleware
