contents/clojure-api.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-07 Tue 13:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Making an API with Clojure</title>
<meta name="author" content="garlic" />
<meta name="generator" content="Org Mode" />
<!-- <link rel="stylesheet" href="https://unpkg.com/sakura.css/css/sakura-dark.css"> -->
</head>
<body>
<div id="content" class="content">
<h1 class="title">Making an API with Clojure</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc91181a">1. Introduction</a>
<ul>
<li><a href="#org68a3097">1.1. Why Clojure?</a></li>
<li><a href="#org5d9c3e3">1.2. Prerequisite knowledge</a></li>
</ul>
</li>
<li><a href="#org473a88f">2. Setting up a basic server</a>
<ul>
<li><a href="#orgd81a617">2.1. Hello World</a></li>
<li><a href="#org7dfc54b">2.2. Running in REPL</a></li>
</ul>
</li>
<li><a href="#org3a33b67">3. Defining routes with Reitit</a>
<ul>
<li><a href="#orgb4388fd">3.1. Basic router</a></li>
<li><a href="#org4195b2e">3.2. Using middleware</a>
<ul>
<li><a href="#orgb26f776">3.2.1. Auth middleware</a></li>
<li><a href="#orgb630008">3.2.2. Format negotiation</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0b58a79">4. Setting up CRUD handlers</a>
<ul>
<li><a href="#org49eb1f5">4.1. Basic SQL handlers</a></li>
<li><a href="#org9ee6607">4.2. Using a connection pool</a></li>
</ul>
</li>
<li><a href="#orgcd858fd">5. Tips and tricks</a>
<ul>
<li><a href="#orgb34a3b1">5.1. Debugging</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgc91181a" class="outline-2">
<h2 id="orgc91181a"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org68a3097" class="outline-3">
<h3 id="org68a3097"><span class="section-number-3">1.1.</span> Why Clojure?</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Clojure is a good choice for building an API if you want both a high level of flexibility and a high level of abstraction and composability, you can have concise, easy to read code without many of the limitations that come with things like Flask.
</p>

<p>
While targeting the JVM might not sound appealing, it does allow us to take advantage of the vast ecosystem of Java code to avoid reinventing the wheel.
</p>

<p>
Clojure might not be ideal for beginners who are learning Python or similar languages since it follows a very different paradigm.
</p>
</div>
</div>
<div id="outline-container-org5d9c3e3" class="outline-3">
<h3 id="org5d9c3e3"><span class="section-number-3">1.2.</span> Prerequisite knowledge</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Basic familiarity with Clojure and API patterns are recommended
</p>
</div>
</div>
</div>
<div id="outline-container-org473a88f" class="outline-2">
<h2 id="org473a88f"><span class="section-number-2">2.</span> Setting up a basic server</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgd81a617" class="outline-3">
<h3 id="orgd81a617"><span class="section-number-3">2.1.</span> Hello World</h3>
<div class="outline-text-3" id="text-2-1">
<p>
This is a simple two-step process
</p>
<ol class="org-ol">
<li><p>
First we must define a ring handler
</p>

<p>
A basic ring handler takes a request and returns a response.  Both of these are simply maps with fields like body, status, headers, etc. and can be modified by middleware to accumulate data.
</p>

<p>
In this example we will ignore the request and just return a simple response.  Specifying the status is not neccessary for 200.
</p></li>
</ol>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #C586C0;">(</span><span style="color: #FF5E5E;">defn</span> <span style="color: #8CDAFF;">handler</span> <span style="color: #FC9354;">[</span>req<span style="color: #FC9354;">]</span>
  <span style="color: #FC9354;">{</span><span style="color: #FC9354;">:status</span> <span style="color: #FC9354; font-weight: bold;">200</span> <span style="color: #FC9354;">:body</span> <span style="color: #FBE3BF;">"Hello World"</span><span style="color: #FC9354;">}</span><span style="color: #C586C0;">)</span>
</pre>
</div>
<ol class="org-ol">
<li><p>
Then we can attach the handler to a Jetty server
</p>

<p>
Here we just need to specify the port, and {:join? false} means the function runs the server in another thread
</p></li>
</ol>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #C586C0;">(</span><span style="color: #E9FDAC;">jetty</span>/run-jetty handler <span style="color: #FC9354;">{</span><span style="color: #FC9354;">:port</span> <span style="color: #FC9354; font-weight: bold;">8000</span> <span style="color: #FC9354;">:join?</span> <span style="color: #FC9354;">false</span><span style="color: #FC9354;">}</span><span style="color: #C586C0;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7dfc54b" class="outline-3">
<h3 id="org7dfc54b"><span class="section-number-3">2.2.</span> Running in REPL</h3>
<div class="outline-text-3" id="text-2-2">
<p>
This works but when changes are made you will have to restart the JVM to stop the server and start it again with new code.  There are two things we can do to make working with a Clojure backend much easier from the REPL:
</p>
<ol class="org-ol">
<li>Save the server in an atom</li>
</ol>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #C586C0;">(</span><span style="color: #FF5E5E;">defonce</span> <span style="color: #E9FDAC;">server</span> <span style="color: #FC9354;">(</span>atom <span style="color: #FC9354;">nil</span><span style="color: #FC9354;">)</span><span style="color: #C586C0;">)</span>
<span style="color: #C586C0;">(</span><span style="color: #FF5E5E;">defn</span> <span style="color: #8CDAFF;">start-server</span> <span style="color: #FC9354;">[]</span>
  <span style="color: #FC9354;">(</span>reset! server <span style="color: #468800;">(</span><span style="color: #E9FDAC;">jetty</span>/run-jetty handler <span style="color: #85DDFF;">{</span><span style="color: #FC9354;">:port</span> <span style="color: #FC9354; font-weight: bold;">8000</span> <span style="color: #FC9354;">:join?</span> <span style="color: #FC9354;">false</span><span style="color: #85DDFF;">}</span><span style="color: #468800;">)</span><span style="color: #FC9354;">)</span><span style="color: #C586C0;">)</span>
<span style="color: #C586C0;">(</span><span style="color: #FF5E5E;">defn</span> <span style="color: #8CDAFF;">stop-server</span> <span style="color: #FC9354;">[]</span>
  <span style="color: #FC9354;">(</span><span style="color: #FF5E5E;">when-some</span> <span style="color: #468800;">[</span>s @server<span style="color: #468800;">]</span>
    <span style="color: #468800;">(</span>.stop s<span style="color: #468800;">)</span>
    <span style="color: #468800;">(</span>reset! server <span style="color: #FC9354;">nil</span><span style="color: #468800;">)</span><span style="color: #FC9354;">)</span><span style="color: #C586C0;">)</span>
</pre>
</div>
<p>
This allows us to restart the server from the REPL, thus loading any new changes without having to restart the whole JVM.
</p>

<p>
Using (defonce) also prevents the server atom being redefined when you load your buffer into the REPL.
</p>
<ol class="org-ol">
<li><p>
Indirectly reference the handler
</p>

<p>
We can improve on the code above so that we don&rsquo;t even have to restart the server to pick up changes.
</p></li>
</ol>
<div class="org-src-container">
<pre class="src src-clojure"> <span style="color: #C586C0;">(</span><span style="color: #FF5E5E;">defn</span> <span style="color: #8CDAFF;">start-server</span> <span style="color: #FC9354;">[]</span>
   <span style="color: #FC9354;">(</span>reset! server <span style="color: #468800;">(</span><span style="color: #E9FDAC;">jetty</span>/run-jetty #'handler <span style="color: #85DDFF;">{</span><span style="color: #FC9354;">:port</span> <span style="color: #FC9354; font-weight: bold;">8000</span> <span style="color: #FC9354;">:join?</span> <span style="color: #FC9354;">false</span><span style="color: #85DDFF;">}</span><span style="color: #468800;">)</span><span style="color: #FC9354;">)</span><span style="color: #C586C0;">)</span>
</pre>
</div>
<p>
Adding #&rsquo; tells the interpreter to execute whatever function is bound to the symbol &ldquo;handler&rdquo; at runtime, so if you redefine &ldquo;handler&rdquo; the server will route to the new definition.
</p>
</div>
</div>
</div>

<div id="outline-container-org3a33b67" class="outline-2">
<h2 id="org3a33b67"><span class="section-number-2">3.</span> Defining routes with Reitit</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgb4388fd" class="outline-3">
<h3 id="orgb4388fd"><span class="section-number-3">3.1.</span> Basic router</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The reitit.ring/router function accepts a vector of routes as its argument.
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #C586C0;">(</span><span style="color: #E9FDAC;">reitit.ring</span>/ring-handler
 <span style="color: #FC9354;">(</span><span style="color: #E9FDAC;">reitit.ring</span>/router
  <span style="color: #468800;">[</span><span style="color: #85DDFF;">[</span><span style="color: #FBE3BF;">"/"</span> <span style="color: #C586C0;">{</span><span style="color: #FC9354;">:get</span> handler<span style="color: #C586C0;">}</span><span style="color: #85DDFF;">]</span>
   <span style="color: #85DDFF;">[</span><span style="color: #FBE3BF;">"/crud"</span> <span style="color: #C586C0;">{</span><span style="color: #FC9354;">:post</span> create-handler
             <span style="color: #FC9354;">:get</span> read-handler
             <span style="color: #FC9354;">:put</span> update-handler
             <span style="color: #FC9354;">:delete</span> delete-handler<span style="color: #C586C0;">}</span><span style="color: #85DDFF;">]</span><span style="color: #468800;">]</span><span style="color: #FC9354;">)</span><span style="color: #C586C0;">)</span>
</pre>
</div>
<p>
It is also easy to nest routes
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #C586C0;">(</span><span style="color: #E9FDAC;">reitit.ring</span>/ring-handler
 <span style="color: #FC9354;">(</span><span style="color: #E9FDAC;">reitit.ring</span>/router
  <span style="color: #468800;">[</span><span style="color: #85DDFF;">[</span><span style="color: #FBE3BF;">"/"</span> <span style="color: #C586C0;">{</span><span style="color: #FC9354;">:get</span> handler<span style="color: #C586C0;">}</span><span style="color: #85DDFF;">]</span>
   <span style="color: #85DDFF;">[</span><span style="color: #FBE3BF;">"/api"</span>
    <span style="color: #C586C0;">[</span><span style="color: #FBE3BF;">"/one"</span> <span style="color: #FC9354;">{</span><span style="color: #FC9354;">:get</span> handler-one<span style="color: #FC9354;">}</span><span style="color: #C586C0;">]</span>
    <span style="color: #C586C0;">[</span><span style="color: #FBE3BF;">"/two"</span> <span style="color: #FC9354;">{</span><span style="color: #FC9354;">:get</span> handler-two<span style="color: #FC9354;">}</span><span style="color: #C586C0;">]</span><span style="color: #85DDFF;">]</span><span style="color: #468800;">]</span><span style="color: #FC9354;">)</span><span style="color: #C586C0;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4195b2e" class="outline-3">
<h3 id="org4195b2e"><span class="section-number-3">3.2.</span> Using middleware</h3>
<div class="outline-text-3" id="text-3-2">
</div>
