contents/clojure-api.org
*** Auth middleware
Ring also lets us wrap routes, or route nodes, with middleware.
The pattern is similar to what you would use with Go, you can define a middleware as a function that takes a handler as an argument, and returns another handler.
You can use these to add data to the request map.
#+begin_src clojure
(defn wrap-priv [handler]
  (fn [req]
    (if (priv? req)
      (handler req)
      {:status 403})))
#+end_src
Imagine priv? is a function that checks headers for a key to decide if a user is privileged, we pass it the request, and if it returns true, the user is authorized.
Now we can use this function in the router data to prevent unauthorized use of specified routes.
#+begin_src clojure
(reitit.ring/ring-handler
 (reitit.ring/router
  [["/" {:get handler}]
   ["/protected" {:middleware [#(wrap-priv %)]
                  :post create-handler
                  :get read-handler
                  :put update-handler
                  :delete delete-handler}]]))
#+end_src
You can also wrap nodes of nested routes, or you could wrap the expression above to require auth for the entire app.

There is also a suprisingly good ecosystem of middlewares to apply, for example JWT authorization can be implemented in a few lines of code with [[https://github.com/kelveden/ring-jwt][ring-jwt]]

First define your secrets
#+begin_src clojure
(def auth-secret
  {:issuers
   {"https://provider-url.us.auth0.com/"
    {:alg :HS256 :secret "******"}}})
#+end_src
Then you can use jwt/wrap-jwt to protect routes.  In this example we will wrap the whole application in JWT auth.
#+begin_src clojure
(def router (ring/ring-handler (ring/router ["/" {:get handler}])))
(def app (jwt/wrap-jwt router auth-secret))
#+end_src
*** Format negotiation
Most APIs have to be able to handle JSON as input, but with Clojure, we want to translate that JSON into EDN, which is the native way to represent data.

[[https://github.com/metosin/muuntaja][muuntaja]] provides content negotiation so that any input with Content-Type: application/json will be converted to EDN, and you can also send data as Content-Type: application/edn if you are working with a Clojure(Script) client

Here is a way you can add muuntaja middleware to your app
#+begin_src clojure
(def app
  (ring/ring-handler
   (ring/router
    ["/" {:get index}]
    {:data {:muuntaja m/instance
            :middleware [muuntaja/format-middleware]}})))
#+end_src

Now you can access POST data from your handlers like this
#+begin_src clojure
(defn handler [req]
  (let [data (:body-params req)]
    {:body data}))
#+end_src
* Setting up CRUD handlers
** Basic SQL handlers
Most useful web apps use a database, for this example we will use Java's JDBC to interact with MySQL.

The simplest way to talk to a database is by passing a specification to each sql operation.  For a MySQL server on localhost your spec will look something like this:
#+begin_src clojure
(def db-spec
  {:host "localhost"
   :port 3306
   :dbtype "mysql"
   :dbname "app"
   :user "haha"
   :password "hehe"})
#+end_src

Here is a basic example of inserting data from a POST request into a sql database.
#+begin_src clojure
(def create-item [req]
  (let [data (:body-params req)]
    (if-let [input (:input-item data)]
      (sql/insert! db-spec :table {:column input}))))
#+end_src
You will want to use muuntaja as middleware to be able to handle edn, json, and other types of input as if it was all edn with no extra code.

