contents/clojure-api.html
<div id="outline-container-orgb26f776" class="outline-4">
<h4 id="orgb26f776"><span class="section-number-4">3.2.1.</span> Auth middleware</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Ring also lets us wrap routes, or route nodes, with middleware.
The pattern is similar to what you would use with Go, you can define a middleware as a function that takes a handler as an argument, and returns another handler.
You can use these to add data to the request map.
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #C586C0;">(</span><span style="color: #FF5E5E;">defn</span> <span style="color: #8CDAFF;">wrap-priv</span> <span style="color: #FC9354;">[</span>handler<span style="color: #FC9354;">]</span>
  <span style="color: #FC9354;">(</span><span style="color: #FF5E5E;">fn</span> <span style="color: #468800;">[</span>req<span style="color: #468800;">]</span>
    <span style="color: #468800;">(</span><span style="color: #FF5E5E;">if</span> <span style="color: #85DDFF;">(</span>priv? req<span style="color: #85DDFF;">)</span>
      <span style="color: #85DDFF;">(</span>handler req<span style="color: #85DDFF;">)</span>
      <span style="color: #85DDFF;">{</span><span style="color: #FC9354;">:status</span> <span style="color: #FC9354; font-weight: bold;">403</span><span style="color: #85DDFF;">}</span><span style="color: #468800;">)</span><span style="color: #FC9354;">)</span><span style="color: #C586C0;">)</span>
</pre>
</div>
<p>
Imagine priv? is a function that checks headers for a key to decide if a user is privileged, we pass it the request, and if it returns true, the user is authorized.
Now we can use this function in the router data to prevent unauthorized use of specified routes.
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #C586C0;">(</span><span style="color: #E9FDAC;">reitit.ring</span>/ring-handler
 <span style="color: #FC9354;">(</span><span style="color: #E9FDAC;">reitit.ring</span>/router
  <span style="color: #468800;">[</span><span style="color: #85DDFF;">[</span><span style="color: #FBE3BF;">"/"</span> <span style="color: #C586C0;">{</span><span style="color: #FC9354;">:get</span> handler<span style="color: #C586C0;">}</span><span style="color: #85DDFF;">]</span>
   <span style="color: #85DDFF;">[</span><span style="color: #FBE3BF;">"/protected"</span> <span style="color: #C586C0;">{</span><span style="color: #FC9354;">:middleware</span> <span style="color: #FC9354;">[</span>#<span style="color: #468800;">(</span>wrap-priv <span style="color: #E9FDAC;">%</span><span style="color: #468800;">)</span><span style="color: #FC9354;">]</span>
                  <span style="color: #FC9354;">:post</span> create-handler
                  <span style="color: #FC9354;">:get</span> read-handler
                  <span style="color: #FC9354;">:put</span> update-handler
                  <span style="color: #FC9354;">:delete</span> delete-handler<span style="color: #C586C0;">}</span><span style="color: #85DDFF;">]</span><span style="color: #468800;">]</span><span style="color: #FC9354;">)</span><span style="color: #C586C0;">)</span>
</pre>
</div>
<p>
You can also wrap nodes of nested routes, or you could wrap the expression above to require auth for the entire app.
</p>

<p>
There is also a suprisingly good ecosystem of middlewares to apply, for example JWT authorization can be implemented in a few lines of code with <a href="https://github.com/kelveden/ring-jwt">ring-jwt</a>
</p>

<p>
First define your secrets
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #C586C0;">(</span><span style="color: #FF5E5E;">def</span> <span style="color: #E9FDAC;">auth-secret</span>
  <span style="color: #FC9354;">{</span><span style="color: #FC9354;">:issuers</span>
   <span style="color: #468800;">{</span><span style="color: #FBE3BF;">"https://provider-url.us.auth0.com/"</span>
    <span style="color: #85DDFF;">{</span><span style="color: #FC9354;">:alg</span> <span style="color: #FC9354;">:HS256</span> <span style="color: #FC9354;">:secret</span> <span style="color: #FBE3BF;">"******"</span><span style="color: #85DDFF;">}</span><span style="color: #468800;">}</span><span style="color: #FC9354;">}</span><span style="color: #C586C0;">)</span>
</pre>
</div>
<p>
Then you can use jwt/wrap-jwt to protect routes.  In this example we will wrap the whole application in JWT auth.
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #C586C0;">(</span><span style="color: #FF5E5E;">def</span> <span style="color: #E9FDAC;">router</span> <span style="color: #FC9354;">(</span><span style="color: #E9FDAC;">ring</span>/ring-handler <span style="color: #468800;">(</span><span style="color: #E9FDAC;">ring</span>/router <span style="color: #85DDFF;">[</span><span style="color: #FBE3BF;">"/"</span> <span style="color: #C586C0;">{</span><span style="color: #FC9354;">:get</span> handler<span style="color: #C586C0;">}</span><span style="color: #85DDFF;">]</span><span style="color: #468800;">)</span><span style="color: #FC9354;">)</span><span style="color: #C586C0;">)</span>
<span style="color: #C586C0;">(</span><span style="color: #FF5E5E;">def</span> <span style="color: #E9FDAC;">app</span> <span style="color: #FC9354;">(</span><span style="color: #E9FDAC;">jwt</span>/wrap-jwt router auth-secret<span style="color: #FC9354;">)</span><span style="color: #C586C0;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb630008" class="outline-4">
<h4 id="orgb630008"><span class="section-number-4">3.2.2.</span> Format negotiation</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
Most APIs have to be able to handle JSON as input, but with Clojure, we want to translate that JSON into EDN, which is the native way to represent data.
</p>

<p>
<a href="https://github.com/metosin/muuntaja">muuntaja</a> provides content negotiation so that any input with Content-Type: application/json will be converted to EDN, and you can also send data as Content-Type: application/edn if you are working with a Clojure(Script) client
</p>

<p>
Here is a way you can add muuntaja middleware to your app
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #C586C0;">(</span><span style="color: #FF5E5E;">def</span> <span style="color: #E9FDAC;">app</span>
  <span style="color: #FC9354;">(</span><span style="color: #E9FDAC;">ring</span>/ring-handler
   <span style="color: #468800;">(</span><span style="color: #E9FDAC;">ring</span>/router
    <span style="color: #85DDFF;">[</span><span style="color: #FBE3BF;">"/"</span> <span style="color: #C586C0;">{</span><span style="color: #FC9354;">:get</span> index<span style="color: #C586C0;">}</span><span style="color: #85DDFF;">]</span>
    <span style="color: #85DDFF;">{</span><span style="color: #FC9354;">:data</span> <span style="color: #C586C0;">{</span><span style="color: #FC9354;">:muuntaja</span> <span style="color: #E9FDAC;">m</span>/instance
            <span style="color: #FC9354;">:middleware</span> <span style="color: #FC9354;">[</span><span style="color: #E9FDAC;">muuntaja</span>/format-middleware<span style="color: #FC9354;">]</span><span style="color: #C586C0;">}</span><span style="color: #85DDFF;">}</span><span style="color: #468800;">)</span><span style="color: #FC9354;">)</span><span style="color: #C586C0;">)</span>
</pre>
</div>

<p>
Now you can access POST data from your handlers like this
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #C586C0;">(</span><span style="color: #FF5E5E;">defn</span> <span style="color: #8CDAFF;">handler</span> <span style="color: #FC9354;">[</span>req<span style="color: #FC9354;">]</span>
  <span style="color: #FC9354;">(</span><span style="color: #FF5E5E;">let</span> <span style="color: #468800;">[</span>data <span style="color: #85DDFF;">(</span><span style="color: #FC9354;">:body-params</span> req<span style="color: #85DDFF;">)</span><span style="color: #468800;">]</span>
    <span style="color: #468800;">{</span><span style="color: #FC9354;">:body</span> data<span style="color: #468800;">}</span><span style="color: #FC9354;">)</span><span style="color: #C586C0;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org0b58a79" class="outline-2">
<h2 id="org0b58a79"><span class="section-number-2">4.</span> Setting up CRUD handlers</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org49eb1f5" class="outline-3">
<h3 id="org49eb1f5"><span class="section-number-3">4.1.</span> Basic SQL handlers</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Most useful web apps use a database, for this example we will use Java&rsquo;s JDBC to interact with MySQL.
</p>

<p>
The simplest way to talk to a database is by passing a specification to each sql operation.  For a MySQL server on localhost your spec will look something like this:
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #C586C0;">(</span><span style="color: #FF5E5E;">def</span> <span style="color: #E9FDAC;">db-spec</span>
  <span style="color: #FC9354;">{</span><span style="color: #FC9354;">:host</span> <span style="color: #FBE3BF;">"localhost"</span>
   <span style="color: #FC9354;">:port</span> <span style="color: #FC9354; font-weight: bold;">3306</span>
   <span style="color: #FC9354;">:dbtype</span> <span style="color: #FBE3BF;">"mysql"</span>
   <span style="color: #FC9354;">:dbname</span> <span style="color: #FBE3BF;">"app"</span>
   <span style="color: #FC9354;">:user</span> <span style="color: #FBE3BF;">"haha"</span>
   <span style="color: #FC9354;">:password</span> <span style="color: #FBE3BF;">"hehe"</span><span style="color: #FC9354;">}</span><span style="color: #C586C0;">)</span>
</pre>
</div>

<p>
Here is a basic example of inserting data from a POST request into a sql database.
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #C586C0;">(</span><span style="color: #FF5E5E;">def</span> <span style="color: #E9FDAC;">create-item</span> <span style="color: #FC9354;">[</span>req<span style="color: #FC9354;">]</span>
  <span style="color: #FC9354;">(</span><span style="color: #FF5E5E;">let</span> <span style="color: #468800;">[</span>data <span style="color: #85DDFF;">(</span><span style="color: #FC9354;">:body-params</span> req<span style="color: #85DDFF;">)</span><span style="color: #468800;">]</span>
    <span style="color: #468800;">(</span><span style="color: #FF5E5E;">if-let</span> <span style="color: #85DDFF;">[</span>input <span style="color: #C586C0;">(</span><span style="color: #FC9354;">:input-item</span> data<span style="color: #C586C0;">)</span><span style="color: #85DDFF;">]</span>
      <span style="color: #85DDFF;">(</span><span style="color: #E9FDAC;">sql</span>/insert! db-spec <span style="color: #FC9354;">:table</span> <span style="color: #C586C0;">{</span><span style="color: #FC9354;">:column</span> input<span style="color: #C586C0;">}</span><span style="color: #85DDFF;">)</span><span style="color: #468800;">)</span><span style="color: #FC9354;">)</span><span style="color: #C586C0;">)</span>
</pre>
</div>
<p>
You will want to use muuntaja as middleware to be able to handle edn, json, and other types of input as if it was all edn with no extra code.
</p>
</div>
</div>
