contents/clojure-api.org
** Using a connection pool
Using the method above works and is simple, but it is slow because it creates a new database connection for each query.  A common way to improve performance is to use a pool of connections that stay alive.

To do this you can use [[https://github.com/tomekw/hikari-cp][hikari-cp]].  The implementation looks very similar to the one above.
#+begin_src clojure
(def db-spec {:adapter            "mysql"
              :username           "haha"
              :password           "hehe"
              :database-name      "app"
              :server-name        "localhost"
              :port-number        3306})

(defonce datasource
  (delay (hik/make-datasource db-spec)))

(defn db-pool [] {:datasource @datasource})
#+end_src
This sets up a pool of connections, and when you need to use one, you can call db-pool and use the output just like the previous example.
#+begin_src clojure
(sql/execute! (db-pool) ["INSERT INTO table (col1, col2) VALUES (?, ?)" val1 val2])
#+end_src
* Tips and tricks
** Debugging
To keep the last request/response pair available in the REPL for debugging can be helpful, this can be implemented as a wrapper around the app
#+BEGIN_SRC clojure
(defonce last-req  (atom nil))
(defonce last-resp (atom nil))

(defn wrap-last [handler]
  (fn [req]
    (reset! last-req req)
    (let [resp (handler req)]
      (reset! last-resp resp)
      resp)))

(def dbg-app (wrap-last app))
#+END_SRC
