contents/clojure-api.html

<div id="outline-container-org9ee6607" class="outline-3">
<h3 id="org9ee6607"><span class="section-number-3">4.2.</span> Using a connection pool</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Using the method above works and is simple, but it is slow because it creates a new database connection for each query.  A common way to improve performance is to use a pool of connections that stay alive.
</p>

<p>
To do this you can use <a href="https://github.com/tomekw/hikari-cp">hikari-cp</a>.  The implementation looks very similar to the one above.
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #C586C0;">(</span><span style="color: #FF5E5E;">def</span> <span style="color: #E9FDAC;">db-spec</span> <span style="color: #FC9354;">{</span><span style="color: #FC9354;">:adapter</span>            <span style="color: #FBE3BF;">"mysql"</span>
              <span style="color: #FC9354;">:username</span>           <span style="color: #FBE3BF;">"haha"</span>
              <span style="color: #FC9354;">:password</span>           <span style="color: #FBE3BF;">"hehe"</span>
              <span style="color: #FC9354;">:database-name</span>      <span style="color: #FBE3BF;">"app"</span>
              <span style="color: #FC9354;">:server-name</span>        <span style="color: #FBE3BF;">"localhost"</span>
              <span style="color: #FC9354;">:port-number</span>        <span style="color: #FC9354; font-weight: bold;">3306</span><span style="color: #FC9354;">}</span><span style="color: #C586C0;">)</span>

<span style="color: #C586C0;">(</span><span style="color: #FF5E5E;">defonce</span> <span style="color: #E9FDAC;">datasource</span>
  <span style="color: #FC9354;">(</span><span style="color: #FF5E5E;">delay</span> <span style="color: #468800;">(</span><span style="color: #E9FDAC;">hik</span>/make-datasource db-spec<span style="color: #468800;">)</span><span style="color: #FC9354;">)</span><span style="color: #C586C0;">)</span>

<span style="color: #C586C0;">(</span><span style="color: #FF5E5E;">defn</span> <span style="color: #8CDAFF;">db-pool</span> <span style="color: #FC9354;">[]</span> <span style="color: #FC9354;">{</span><span style="color: #FC9354;">:datasource</span> @datasource<span style="color: #FC9354;">}</span><span style="color: #C586C0;">)</span>
</pre>
</div>
<p>
This sets up a pool of connections, and when you need to use one, you can call db-pool and use the output just like the previous example.
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #C586C0;">(</span><span style="color: #E9FDAC;">sql</span>/execute! <span style="color: #FC9354;">(</span>db-pool<span style="color: #FC9354;">)</span> <span style="color: #FC9354;">[</span><span style="color: #FBE3BF;">"INSERT INTO table (col1, col2) VALUES (?, ?)"</span> val1 val2<span style="color: #FC9354;">]</span><span style="color: #C586C0;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgcd858fd" class="outline-2">
<h2 id="orgcd858fd"><span class="section-number-2">5.</span> Tips and tricks</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgb34a3b1" class="outline-3">
<h3 id="orgb34a3b1"><span class="section-number-3">5.1.</span> Debugging</h3>
<div class="outline-text-3" id="text-5-1">
<p>
To keep the last request/response pair available in the REPL for debugging can be helpful, this can be implemented as a wrapper around the app
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #C586C0;">(</span><span style="color: #FF5E5E;">defonce</span> <span style="color: #E9FDAC;">last-req</span>  <span style="color: #FC9354;">(</span>atom <span style="color: #FC9354;">nil</span><span style="color: #FC9354;">)</span><span style="color: #C586C0;">)</span>
<span style="color: #C586C0;">(</span><span style="color: #FF5E5E;">defonce</span> <span style="color: #E9FDAC;">last-resp</span> <span style="color: #FC9354;">(</span>atom <span style="color: #FC9354;">nil</span><span style="color: #FC9354;">)</span><span style="color: #C586C0;">)</span>

<span style="color: #C586C0;">(</span><span style="color: #FF5E5E;">defn</span> <span style="color: #8CDAFF;">wrap-last</span> <span style="color: #FC9354;">[</span>handler<span style="color: #FC9354;">]</span>
  <span style="color: #FC9354;">(</span><span style="color: #FF5E5E;">fn</span> <span style="color: #468800;">[</span>req<span style="color: #468800;">]</span>
    <span style="color: #468800;">(</span>reset! last-req req<span style="color: #468800;">)</span>
    <span style="color: #468800;">(</span><span style="color: #FF5E5E;">let</span> <span style="color: #85DDFF;">[</span>resp <span style="color: #C586C0;">(</span>handler req<span style="color: #C586C0;">)</span><span style="color: #85DDFF;">]</span>
      <span style="color: #85DDFF;">(</span>reset! last-resp resp<span style="color: #85DDFF;">)</span>
      resp<span style="color: #468800;">)</span><span style="color: #FC9354;">)</span><span style="color: #C586C0;">)</span>

<span style="color: #C586C0;">(</span><span style="color: #FF5E5E;">def</span> <span style="color: #E9FDAC;">dbg-app</span> <span style="color: #FC9354;">(</span>wrap-last app<span style="color: #FC9354;">)</span><span style="color: #C586C0;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: garlic</p>
<p class="date">Created: 2023-02-07 Tue 13:58</p>
</div>
</body>
</html>
